I have tried to change the code to use the exact annotations and the problem is still there:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_service.instance will be created
  + resource "google_cloud_run_service" "instance" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "europe-west1"
      + name                       = "test1"
      + project                    = "cybernetic-tide-317715"
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale" = "1000"
                  + "autoscaling.knative.dev/minScale" = "1"
                  + "generated-by"                     = "magic-modules"
                  + "run.googleapis.com/client-name"   = "terraform"
                  + "run.googleapis.com/launch-stage"  = "BETA"
                  + "run.googleapis.com/secrets"       = "secret-a8ada0b7-f433-756a-d776-f22d68009edc:projects/994503404540/secrets/api_secret_key"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = 80
              + serving_state         = (known after apply)
              + timeout_seconds       = 299

              + containers {
                  + image = "us-docker.pkg.dev/cloudrun/container/hello"

                  + env {
                      + name = "SECRET_KEY"

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "projects/994503404540/secrets/api_secret_key"
                            }
                        }
                    }

                  + ports {
                      + container_port = 80
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "1Gi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_cloud_run_service.instance: Creating...
╷
│ Error: Error creating Service: googleapi: Error 400: spec.template.spec.containers[0].env.value_from: spec.template.spec.containers[0].env.value_from should be empty
│ Details:
│ [
│   {
│     "@type": "type.googleapis.com/google.rpc.BadRequest",
│     "fieldViolations": [
│       {
│         "description": "spec.template.spec.containers[0].env.value_from should be empty",
│         "field": "spec.template.spec.containers[0].env.value_from"
│       }
│     ]
│   }
│ ]
│
│   with google_cloud_run_service.instance,
│   on main.tf line 23, in resource "google_cloud_run_service" "instance":
│   23: resource "google_cloud_run_service" "instance" {
│
╵
```